[
  {
    "id": 8,
    "title": "Entry 8",
    "content": "Holaaaaa, hoy mi dia fue bueno yo fui a la centro comercial (mall) con mis amigos y fue muy divertido! Yo compre dos camisetas que me gustan mucho y estoy muy feliz de comprarlos! Manana voy a ir a una fiesta y estoy muy emocionada! Esta fiesta esta en una casa que tiene una en frente de un largo! Va a ser muy interesante.",
    "date": "2025-08-24",
    "correctedContent": "¡Hola! Hoy mi día fue bueno. Fui al centro comercial con mis amigos y fue muy divertido. Compré dos camisetas que me gustan mucho y estoy muy feliz de haberlas comprado. Mañana voy a ir a una fiesta y estoy muy emocionada. Esta fiesta es en una casa que está enfrente de un lago. Va a ser muy interesante.",
    "isCorrected": true
  },
  {
    "id": 7,
    "title": "Entry 7",
    "content": "Hoy yo fui a montar mi bicileta con mi amigo de ingeneria. Y fue divertido pero no hicimos mucho bicileta y en cambio hablamos mucho, demasiado en mí opinion. Yo quiero aprender machine learning y cybersecurity pero creo que yo no voy a tener tiempo porque mis classes van a empezar pronto. Pero voy a hacer mi mejor esfuerzo para aprender eso, y creo que voy a lograrlo!",
    "date": "2025-08-24",
    "correctedContent": "Hoy fui a montar mi bicicleta con mi amigo de ingeniería. Fue divertido pero no montamos mucho en bicicleta y en cambio hablamos mucho, demasiado en mi opinión. Yo quiero aprender machine learning y ciberseguridad pero creo que no voy a tener tiempo porque mis clases van a empezar pronto. Pero voy a hacer mi mejor esfuerzo para aprender eso, y creo que voy a lograrlo!",
    "overallFeedback": "",
    "isCorrected": true
  },
  {
    "id": 6,
    "title": "Entry 6",
    "content": "Hola, que tal. Hoy yo fui a una caminata (hike), fue divertido pero ahora tengo dolor de la cabeza y no sé que hacer. No sé si debo tomar una pastilla o no, porque yo sé que estos cosas son malas para ti. La caminata fue divertido sí pero ahora estoy muy cansada y creo que voy a descansar mucho.",
    "date": "2025-08-23",
    "correctedContent": "Hola, ¿qué tal? Hoy fui de caminata, fue divertida pero ahora tengo dolor de cabeza y no sé qué hacer. No sé si debo tomar una pastilla o no, porque yo sé que estas cosas son malas para ti. La caminata fue divertida, sí, pero ahora estoy muy cansada y creo que voy a descansar mucho.",
    "overallFeedback": "The text shows good command of basic Spanish structures. Main areas for improvement include: gender agreement with feminine nouns (divertida with caminata, estas with cosas), proper punctuation with questions (¿qué tal?), removing unnecessary pronouns (yo before fui), and using the expression 'ir de caminata' instead of 'ir a una caminata'. Also note that 'dolor de cabeza' is the standard expression without the article 'la'.",
    "isCorrected": true
  },
  {
    "id": 5,
    "title": "Entry 5",
    "content": "Hoy, tuve una día que sentí muy larga porque tenía trabajo. Fue bien pero yo siempre siento que todo que yo hace no es correcto y no me gusta esta sentimiento. No sé si todo mis trabajos van a ser así, espero que no pero nunca sabes supongo. Yo espero que en la futura voy a tener un trabajo que estoy muy bien en.",
    "date": "2025-08-21",
    "correctedContent": "Hoy tuve un día que sentí muy largo porque tenía mucho trabajo. Fue bien, pero siempre siento que todo lo que hago no es correcto y no me gusta este sentimiento. No sé si todos mis trabajos van a ser así, espero que no, pero nunca se sabe, supongo. Espero que en el futuro voy a tener un trabajo en el que esté muy bien.",
    "overallFeedback": "The text shows good intermediate Spanish with clear communication of ideas. Main areas for improvement include: gender agreement (un día/este sentimiento), relative pronouns (todo lo que), verb conjugations (se sabe), and some missing punctuation. The meaning is clear throughout, though some expressions could be more natural. Consider using 'me vaya muy bien' instead of 'esté muy bien' for a more idiomatic expression.",
    "isCorrected": true
  },
  {
    "id": 4,
    "title": "Entry 4",
    "content": "Hola! Hoy aprendí como pintar con lejía (bleach)! Fue una experiencia muy interesante. Fue fascinante ver como la lejía pude transformar la fabríca. Pero durante eso, mucha lejía fue en mis manos y estoy preocupada que manaña voy a tener erupciones (rashes), y eso me da miedo, pero creo que eso na va a pasar porque eso tiene mucha pequeño probalidad.",
    "date": "2025-08-20",
    "correctedContent": "¡Hola! Hoy aprendí cómo pintar con lejía (bleach). Fue una experiencia muy interesante. Fue fascinante ver cómo la lejía puede transformar la tela. Pero durante eso, mucha lejía cayó en mis manos y estoy preocupada de que mañana voy a tener erupciones (rashes), y eso me da miedo, pero creo que eso no va a pasar porque tiene muy poca probabilidad.",
    "isCorrected": true
  },
  {
    "id": 3,
    "title": "Entry 3 - Pescar",
    "content": "Hola, hoy tenía que despertar muy temprano a las seis para ir a pascar. Yo atrapè una pesca que fue un poco pequeño. Despues de eso, yo cortè la pesca y tambien usó una machina que es llamado \"pressure washer\" en íngles para quitarse de las escamas (scales). Y entonces, yo fuí a mi cama para dormir porque yo solo dormí cuatro horas. ",
    "date": "2025-08-19",
    "correctedContent": "Hola, hoy tuve que despertar muy temprano a las seis para ir a pescar. Yo atrapé un pez que fue un poco pequeño. Después de eso, yo corté el pescado y también usé una máquina que se llama 'pressure washer' en inglés para quitarle las escamas (scales). Y entonces, yo fui a mi cama para dormir porque yo solo dormí cuatro horas.",
    "isCorrected": true,
    "overallFeedback": "The text shows good narrative structure and vocabulary range. Main areas for improvement include: 1) Verb tense consistency (mixing past tenses), 2) Vocabulary precision ('pescar' vs 'pascar', 'pez/pescado' vs 'pesca'), 3) Accent marks on past tense verbs and other words, and 4) Some reflexive pronoun usage. The overall message is clear and the storytelling flows well."
  },
  {
    "id": 2,
    "title": "Entry dos - Inicial",
    "content": "Hola mi nombre es Alina y tengo muchas ganas de aprender espanol. No tengo mucho experiencia hablando pero yo siempre ve filmes en espanol y eschucho musica. Yo espero que esto va a mejorar mi espanol. Creo que es mas facil escriber que hablar porque tengo mas tiempo para pensar como yo debo hablar. ",
    "date": "2025-08-16",
    "correctedContent": "Hola, mi nombre es Alina y tengo muchas ganas de aprender español. No tengo mucha experiencia hablando, pero yo siempre veo películas en español y escucho música. Yo espero que esto vaya a mejorar mi español. Creo que es más fácil escribir que hablar porque tengo más tiempo para pensar cómo debo hablar.",
    "isCorrected": true,
    "overallFeedback": "Buen uso de la gramática y vocabulario. Algunas correcciones menores en conjugaciones y acentos."
  },
  {
    "id": 1,
    "title": "Entry 1",
    "content": "Este es el contenido del primer entry",
    "date": "2025-08-14",
    "correctedContent": "Here goes the corrected content",
    "isCorrected": true
  }
]